<a href="https://colab.research.google.com/github/mottaquikarim/pycontent/blob/master/content/raw_data/wrangling_pset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Earth Surface Temperature by City from 1743-2014

#### Data Dictionary:

This is a "...[repackaging] the data from a newer compilation put together by the Berkeley Earth, which is affiliated with Lawrence Berkeley National Laboratory. The Berkeley Earth Surface Temperature Study combines 1.6 billion temperature reports from 16 pre-existing archives."

"Early data was collected by technicians using mercury thermometers, where any variation in the visit time impacted measurements. In the 1940s, the construction of airports caused many weather stations to be moved. In the 1980s, there was a move to electronic thermometers that are said to have a cooling bias."

* `dt`: Date of temperature observation in format "YYYY-MM-DD"; ranges from 1743-2013
* `AverageTemperature`: in degress Celsius
* `AverageTemperatureUncertainty`: the 95% confidence interval around the average
* `City`
* `Country`
* `Latitude`
* `Longitude`

**Source**: https://www.kaggle.com/berkeleyearth/climate-change-earth-surface-temperature-data

#### 1. Import the necessary libraries. Load the data into a df called "landTemps" and preview it.

The link below leads to a zip file. You'll have to download it, unzip it, and then upload the unzipped CSV into your Colab notebook. To do so, click on the folder icon in the leftand menu, and you'll find the upload button.

https://drive.google.com/open?id=1jDD8KBPFa61GR0FFjj-QXgYRlDn-UuvJ

In [0]:
import pandas as pd
import numpy as np
print('done')

In [0]:
landTemps = pd.read_csv('GlobalLandTemperaturesByCity.csv.zip', compression='zip')
landTemps.tail(10)

In [0]:
landTemps.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8599212 entries, 0 to 8599211
Data columns (total 6 columns):
dt                    object
AverageTemperature    float64
City                  object
Country               object
Latitude              object
Longitude             object
dtypes: float64(1), object(5)
memory usage: 393.6+ MB

#### 2. How many total records are there in the df? Save this to a variable

In [0]:
total_records = len(landTemps)
total_records

8599212

#### 3. What data type fills the dt column?

In [0]:
type(landTemps['dt'].iloc[0])

str

#### 4. Rename the dt and AverageTemperature columns to Date and AvgTemp respectively.

In [0]:
landTemps.rename(columns={'dt': 'Date', 'AverageTemperature': 'AvgTemp'}, inplace=True)
landTemps.columns

Index(['Date', 'AvgTemp', 'City', 'Country', 'Latitude', 'Longitude'], dtype='object')

#### 5. What countries are represented? Save them in a Series called "country_names" and sort alphabetically.

In [0]:
landTemps['Country'].nunique() # 159
country_names = pd.Series(landTemps['Country'].unique())
country_names.sort_values(inplace=True)
country_names

60     Afghanistan
107        Albania
34         Algeria
76          Angola
61       Argentina
          ...
19       Venezuela
57         Vietnam
23           Yemen
98          Zambia
92        Zimbabwe
Length: 159, dtype: object

#### 6. Drop the "Latitude" and "Longitude" columns.

In [0]:
landTemps.drop(columns=['Latitude', 'Longitude'], inplace=True)
landTemps.columns

Index(['Date', 'AvgTemp', 'City', 'Country'], dtype='object')

#### 7. How many duplicate rows are there?
p.s. Why do you think these exist?

In [0]:
num_dups = landTemps.duplicated().sum()
num_dups

1069

In [0]:
landTemps[landTemps.duplicated()]

               Date  AvgTemp       City        Country
485434   1778-07-01      NaN     Aurora  United States
485435   1778-08-01      NaN     Aurora  United States
485460   1780-09-01      NaN     Aurora  United States
485461   1780-10-01      NaN     Aurora  United States
485462   1780-11-01      NaN     Aurora  United States
...             ...      ...        ...            ...
7405521  1865-11-01      NaN      Taman      Indonesia
7405522  1865-12-01      NaN      Taman      Indonesia
7407295  2013-09-01      NaN      Taman      Indonesia
8406196  2013-09-01      NaN     Yichun          China
8414742  2013-09-01      NaN  Yingcheng          China

[1069 rows x 4 columns]

#### 8. Drop the duplicate rows from this version of the landTemps df.

In [0]:
landTemps.drop_duplicates(inplace=True)

In [0]:
num_dups = landTemps.duplicated().sum()
num_dups

0

#### 9. How many records are there for Venezuela?

In [0]:
len(landTemps[landTemps['City'] == 'Venezuela'])

#### 10. How many null values are there for AvgTemp?

In [0]:
pd.isnull(landTemps['AvgTemp'])
landTemps['AvgTemp'].isna().sum()

363063

#### 11. **Using filtering techniques**, return the dataframe such that only rows with valid temperatures are included.

In [0]:
# landTemps.dropna(axis=0, subset=['AvgTemp'], inplace=True)
landTemps = landTemps[pd.notnull(landTemps['AvgTemp'])]

#### 12. What percent of the original df records is left?

In [0]:
len(landTemps)/total_records

0.957655189801112

#### 13. Sort by AvgTemp low to high

In [0]:
landTemps.sort_values(by=['AvgTemp'], ascending=False, inplace=True)
landTemps.head()

               Date  AvgTemp               City  Country
8148236  1761-07-01   39.651             Warqla  Algeria
4686139  2013-07-01   39.156  Masjed E Soleyman     Iran
117009   2013-07-01   39.156              Ahvaz     Iran
4686127  2012-07-01   39.153  Masjed E Soleyman     Iran
116997   2012-07-01   39.153              Ahvaz     Iran

#### 14. Look at the rows with the 25 highest and lowest recorded temperatures.

In [0]:
landTemps.head(25)

               Date  AvgTemp               City  Country
8148236  1761-07-01   39.651             Warqla  Algeria
4686139  2013-07-01   39.156  Masjed E Soleyman     Iran
117009   2013-07-01   39.156              Ahvaz     Iran
4686127  2012-07-01   39.153  Masjed E Soleyman     Iran
116997   2012-07-01   39.153              Ahvaz     Iran
116973   2010-07-01   38.964              Ahvaz     Iran
4686103  2010-07-01   38.964  Masjed E Soleyman     Iran
4685983  2000-07-01   38.899  Masjed E Soleyman     Iran
116853   2000-07-01   38.899              Ahvaz     Iran
116985   2011-07-01   38.793              Ahvaz     Iran
4686115  2011-07-01   38.793  Masjed E Soleyman     Iran
4685995  2001-07-01   38.630  Masjed E Soleyman     Iran
116865   2001-07-01   38.630              Ahvaz     Iran
116926   2006-08-01   38.585              Ahvaz     Iran
4686056  2006-08-01   38.585  Masjed E Soleyman     Iran
4686043  2005-07-01   38.563  Masjed E Soleyman     Iran
116913   2005-07-01   38.563              Ahvaz     Iran
116830   1998-08-01   38.537              Ahvaz     Iran
4685960  1998-08-01   38.537  Masjed E Soleyman     Iran
28156    2012-07-01   38.531             Abadan     Iran
3796421  2012-07-01   38.531       Khorramshahr     Iran
4686055  2006-07-01   38.468  Masjed E Soleyman     Iran
116925   2006-07-01   38.468              Ahvaz     Iran
116805   1996-07-01   38.437              Ahvaz     Iran
4685935  1996-07-01   38.437  Masjed E Soleyman     Iran

In [0]:
landTemps.tail(25)

               Date  AvgTemp        City Country
4067783  1889-01-01  -37.029       Kyzyl  Russia
5307871  1915-01-01  -37.128     Norilsk  Russia
4067710  1882-12-01  -37.219       Kyzyl  Russia
5308820  1994-02-01  -37.248     Norilsk  Russia
7919596  1915-01-01  -37.443  Ust Ilimsk  Russia
5307511  1885-01-01  -37.488     Norilsk  Russia
4068179  1922-01-01  -37.625       Kyzyl  Russia
7919332  1893-01-01  -37.713  Ust Ilimsk  Russia
5308412  1960-02-01  -37.869     Norilsk  Russia
5307632  1895-02-01  -38.085     Norilsk  Russia
5308976  2007-02-01  -38.344     Norilsk  Russia
5308903  2001-01-01  -38.389     Norilsk  Russia
4067459  1862-01-01  -38.396       Kyzyl  Russia
5308902  2000-12-01  -38.447     Norilsk  Russia
4067915  1900-01-01  -38.693       Kyzyl  Russia
5307956  1922-02-01  -38.715     Norilsk  Russia
5308520  1969-02-01  -38.784     Norilsk  Russia
4068743  1969-01-01  -38.906       Kyzyl  Russia
4067579  1872-01-01  -38.951       Kyzyl  Russia
4068143  1919-01-01  -39.038       Kyzyl  Russia
5308639  1979-01-01  -39.403     Norilsk  Russia
5308579  1974-01-01  -39.683     Norilsk  Russia
5308484  1966-02-01  -39.919     Norilsk  Russia
4067831  1893-01-01  -41.101       Kyzyl  Russia
5308640  1979-02-01  -42.704     Norilsk  Russia

#### 15. Sort by Date (early to recent), then Country (alphabetical), then AvgTemp (high to low).

In [0]:
landTemps.sort_values(by=['Date', 'Country', 'AvgTemp'], ascending=[True, True, False], inplace=True)
landTemps.head(10)

               Date  AvgTemp       City  Country
2127589  1743-11-01   12.686     Durrës  Albania
7621728  1743-11-01   12.686     Tirana  Albania
2195210  1743-11-01   12.686    Elbasan  Albania
8017080  1743-11-01    4.112     Vienna  Austria
4289042  1743-11-01    3.336       Linz  Austria
2650981  1743-11-01    2.997       Graz  Austria
3197101  1743-11-01    1.323  Innsbruck  Austria
6593991  1743-11-01    1.271   Salzburg  Austria
1127149  1743-11-01    2.626      Brest  Belarus
3018155  1743-11-01    2.347     Hrodna  Belarus

#### 16. Reset the index of the df.

In [0]:
landTemps.reset_index(drop=True, inplace=True) # drop=False? or True?
landTemps